Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/telecommunications_and_postal_services/regulation_of_premium_rate_telephone_services.html.txt.tmx
Source language: en
Languages: ga

source: Regulation of premium rate telephone services
ga: Seirbhísí gutháin ardráta a rialú

source: Since 12 July 2010 premium rate telephone services in Ireland are regulated by ComReg (Commission for Communications Regulation)
ga: Ón 12 Iúil 2010, déanfar seirbhísí gutháin ardráta a rialú ag ComReg (an Coimisiún um Rialáil Cumarsáide)

source: It was previously regulated by RegTel
ga: Bhíodh na seirbhísí á rialú ag RegTel roimhe seo

source: Comreg operates through a strict Code of Practice, which all service providers in Ireland must comply with
ga: Oibríonn ComReg trí Chód dian Cleachtais, nach mór do gach soláthraí seirbhísí in Éirinn cloí leis

source: ComReg is also required to assure consumer protection when using national or international premium rate services and to also set in place procedures to deal with consumer complaints that arise from using these services
ga: Tá freagracht ar ComReg, freisin, as cosaint a chinntiú don tomhaltóir nuair a bhaineann sé/sí úsáid as seirbhísí ardráta náisiúnta nó idirnáisiúnta chom maith le nósanna imeachta oibre a chur i bhfeidhm le déileáil le gearáin ó thomhaltóirí a bhaineann úsáid as na seirbhísí seo

source: What are premium rate telephone services?
ga: Céard iad seirbhísí gutháin ardráta?

source: Premium rate telephone services are services provided by companies or individuals on premium rate telephone numbers
ga: Seirbhísí a sholáthraíonn cuideachtaí nó daoine aonair ar uimhreacha gutháin ardráta iad seirbhísí gutháin ardráta

source: The range of services on offer include general information such as Weather Forecasting, Traffic News, Stock Exchange Reports and Sport Results, as well as Advice and Entertainment services
ga: Áirítear i measc an réimse seirbhísí atá ar tairiscint, faisnéis ghinearálta ar nós Réamhfhaisnéis Aimsire, Nuacht Tráchta, Tuarascálacha Stocmhalartáin agus Torthaí Spóirt, mar aon le seirbhísí Comhairle agus Siamsaíochta

source: These services are sometimes referred to as Information Services and can be recognised by their unique range of prefixes: 15xx
ga: Tugtar Seirbhísí Faisnéise amanna ar na seirbhísí seo agus is féidir iad a aithint leis an réimse uathúil réamhuimhreacha a mbaintear úsáid astu: 15xx

source: The 1598 prefix is dedicated solely to "adult" services
ga: Baineann an réamhuimhir 1598 le seirbhísí do dhaoine fásta amháin agus ní féidir teacht ar na seirbhísí seo gan uimhir phearsanta aitheantais a eisíonn an tOibritheoir Naisc don Tomhaltóir

source: There are also Premium Rate SMS Services (known as PSMS) and these are recognised by a 5 digit Short Code beginning with the number 5, for example, a service providing ringtones
ga: Ina theannta sin, is ann do Sheirbhísí Ardráta SMS (ar a dtugtar PSMS) agus aithnítear seo ag Gearrchód 5 Dhigit a thosaíonn leis an uimhir 5, mar shampla, seirbhís a chuireann clingthoin ar fáil

source: Services of a sexual nature use a 5 digit Short Code beginning with the numbers 57
ga: Úsáideann seirbhísí de chineál gnéasach Gearrchód 5 Dhigit a thosaíonn le 57 agus ní féidir iad a rochtain ach amháin le huimhir phearsanta aitheantais a eisíonn an Soláthraí Seirbhíse

source: Premium rate services are accessed either through fixed-line telephones, mobile phones, the Internet or through auto-diallers on personal computers
ga: Faightear rochtain ar sheirbhísí ardráta trí ghutháin líne seasta, gutháin phóca, an tIdirlíon nó trí uathdhiaileoirí ar ríomhairí pearsanta

source: The services are advertised in print media and on television, radio and the Internet
ga: Fógraítear na seirbhísí sna meáin chlóite agus ar an teilifís, an raidió agus an tIdirlíon

source: Calls to premium rate services cost more than ordinary telephone calls and each prefix has a specific call cost
ga: Cosnaíonn glaonna ardráta níos mó ná ghnáthghlaonna gutháin agus costas faoi leith ag baint le gach réamhuimhir

source: Call charges from mobile phones are generally higher and the surcharge varies according to the mobile network operator
ga: Go hiondúil, cosnaíonn sé níos mó glao a chur orthu ó ghutháin shoghluaiste agus braitheann an formhuirear ar Oibreoir an Líonra Gutháin Shoghluaiste

source: Premium rate call charges are billed to consumers' telephone accounts and are generally listed separately
ga: Gearrtar táillí glao ardráta ar chuntais ghutháin na dtomhaltóirí agus is iondúil go liostaítear iad in áit faoi leith

source: The overall charge to the consumer is shared between the network operator, the service provider or anyone else who contributes to the provision of the service
ga: Roinntear an costas foriomlán a ghearrtar ar an tomhaltóir idir an tOibreoir Naisc, an Soláthraí Seirbhíse nó aon duine eile a chuireann le soláthar na seirbhíse

source: If you would like to have all premium rate services barred from your telephone, you should contact your telephone service provider
ga: Más mian leat cosc a chur ar do ghuthán a bheith in ann glaonna a chur ar sheirbhísí ardráta, ba cheart duit dul i dteagmháil le do sholáthraí seirbhíse gutháin

source: Some telephone service providers provide this service free of charge
ga: Déanann cuid de na soláthraithe seirbhíse an tseirbhís seo a chur ar fáil saor in aisce

source: Unsubscribing from a text service
ga: Díshuibscríobh le seirbhís teachtaireachtaí téacs

source: If you want to unsubscribe from a Premium Rate SMS Service use the reply button on your mobile to the last message you received and send the word stop
ga: Más mian leat díshuibscríobh ó Sheirbhís Ardráta SMS, úsáid an cnaipe ‘freagair’ ar do ghuthán soghluaiste agus tabhair freagra ar an teachtaireacht deireanach a fuair tú agus seol an focal ‘stop’

source: If you do not have a 5 digit number to send it to, ask your mobile telephone network operator for the number attached to the last message you received
ga: Mura bhfuil uimhir 5 dhigit agat chun é a sheoladh chuige, iarr ar d’oibreoir líonra gutháin shoghluaiste don uimhir atá ceangailte leis an teachtaireacht dheireanach a fuair tú

source: You should be unsubscribed within 48 hours of sending the stop command
ga: Ba cheart duit bheith díshuibhscríofa laistigh de 48 uair an chloig tar éis an t-ordú ‘stop’ a sheoladh

source: ComReg has more information on unsubscibing from a text service as well as help in finding the service provider's contact details
ga: Tá ag ComReg tuilleadh faisnéise ar dhíshuibscríobh ó sheirbhís teachtaireacht téacs mar aon le cabhrú chun teacht ar shonraí teagmhála an tsoláthróra seirbhíse ar a láithreán gréasáin

source: Service Providers must comply fully with the provisions of the Data Protection Act, 1988, (and any amendment or replacement legislation) with regard to the collection, processing, keeping, use and disposal of personal data
ga: Ní mór do sholáthraithe cloí go hiomlán le forálacha an Achta um Chosaint Sonraí, 1988, (agus le haon leasú air sin, nó le haon reachtaíocht a thagann ina ionad) maidir le sonraí pearsanta a bhailiú, a phróiseáil, a choinneáil, agus a úsáid agus fáil réidh ansin leo

source: Services that involve the collection of personal information, such as names, addresses and telephone numbers (including calling line identification or caller display information) must make clear to you the reason why this information is required
ga: Ní mór do sheirbhísí a bhailíonn sonraí pearsanta, ainmneacha agus uimhreacha gutháin, mar shampla (córais aitheantais/taispeántais na n-uimhreacha a ghlaonn ar an tseirbhís san áireamh) a chur in iúl go soiléir duit cén fáth go dteastaíonn an t-eolas seo uathu

source: If personal information held about you is being put to different use, you must be notified of this use to give you an opportunity to prevent this, if you wish
ga: Má tá sonraí pearsanta coimeádta fút agus in úsáid ar mhaithe le rudaí éagsúla, ní mór é sin a chur in iúl duit agus deis a thabhairt duit stop a chur leis más mian leat

source: Advertising of premium rate telephone services
ga: Fógraíocht a dhéanamh ar sheirbhísí gutháin ardráta

source: The advertisement of premium rate telephone services in Ireland on television, print media and radio and online must comply with standards to protect consumers
ga: Má dhéantar fógraíocht ar sheirbhísí gutháin ardráta in Éirinn ar an teilifís, sna meáin chlóite, ar an raidió agus ar an idirlín, ní mór don fhógraíocht seo cloí le caighdeáin fhíor-dhiana chun tomhaltóirí a chosaint

source: For example, no premium rate service may be promoted as being "free"
ga: Mar shampla, ní féidir bolscaireacht a dhéanamh ar aon seirbhís ardráta mar sheirbhís atá “in aisce”

source: No product or service may be described as "free" if it is obtainable only by the use of a premium rate service
ga: Ní féidir a lua go bhfuil seirbhís “in aisce” mura féidir teacht uirthi ach amháin trí úsáid a bhaint as seirbhís ardráta

source: Premium rate services must be authorised by ComReg and network operators must not issue a Premium Rate Number or a SMS Short Code until they receive the ComReg letter of authorisation
ga: Ní mór do sheirbhísí ardráta a bheith údaraithe ag ComReg agus ní eiseoidh Oibreoirí Líonra Uimhir Ardráta ná Gearrchód SMS go dtí go bhfaigheann siad litir údaraithe ó ComReg

source: An age warning must be given wherever a service is not aimed at children
ga: Ní mór rabhadh aoise a thabhairt pé uair nach ndírítear seirbhís ar leanaí

source: This applies especially to competitions, all chat/dating services, ringtones & Logos, games and all subscription services
ga: Baineann seo go dlúth le comórtais, gach seirbhís comhrá/geandála, clingthoin agus Lógónna, cluichí agus gach seirbhís suibscríofa

source: Where a particular type of service requires a price warning, the caller, on spending the specified monetary amount, must be made aware of that spend
ga: Sa chás go dteastaíonn rabhadh praghais ó shaghas ar leith de sheirbhís, ní mór an glaoiteoir, tar éis dóibh an tsuim shonraithe airgid a chaitheamh, a bheith curtha ar an eolas ar an gcaitheamh sin

source: Service providers must provide a live operator consumer helpline to handle consumer queries and complaints
ga: Ní mór do Sholáthraithe Seirbhís líne chabhrach bheo oibreora a chur ar fáil chun fiosrúcháin agus gearáin ó thomhaltóirí a láimhseáil

source: This helpline must operate during normal office hours
ga: Ní mór don líne chabhrach seo oibriú le linn gnáthuaireanta oifige

source: International Audiotex Regulators Network
ga: Líonra Rialtóirí Idirnáisiúnta Audiotex

source: The International Audiotex Regulators Network (IARN) is a network of of organisations that are involved in the regulation of, or the setting of standards for, the content and promotion of premium rate services in their own countries
ga: Líonra atá i Líonra Rialtóirí Idináisiúnta Audiotex (IARN) d’eagraíochtaí atá bainteach i rialú, nó socrú caighdeán ar mhaithe le hábhar agus cur chun cinn na seirbhísí ardráta ina dtíortha féin

source: It maintains a set of guidelines known as the IARN handbook (pdf) which advises on requirements to assure consumer protection when using national or international premium rate services
ga: Coimeádann siad sraith treoirlínte ar a dtugtar lámhleabhar an IARN (pdf) a thugann comhairle ar cheanglais le cosaint tomhaltóra a chinntiú agus seirbhísí ardráta náisiúnta nó idirnáisiúnta á n-úsáid

source: If you have a complaint or concern, contact the premium rate service provider with your complaint
ga: Má tá gearán nó ábhar buartha agat, déan teagmháil leis an soláthraí seirbhíse ardráta le do ghearán

source: If you are not satisfied with their response you can submit your complaint to ComReg
ga: Mura bhfuil tú sásta leis an bhfreagra a thugann siad, féadfaidh tú do ghearán a chur faoi bhráid ComReg

source: Complaints must be made within 9 months of use of the service, however, exceptions to this rule are entirely at the discretion of the Regulator
ga: Ní mór gearán a dhéanamh laistigh de 9 mhí tar éis an tseirbhís a úsáid, áfach, is faoi dhiscréid iomlán an Rialtóra eisceachtaí leis an riail seo

source: It is also important to note that all complaints are dealt with in confidence
ga: Ina theannta sin, tá sé ina thábhacht a thabhairt faoi deara go ndéileáiltear le gach gearán faoi rún

source: You should note that disputes regarding or concerning the call cost of a premium rate service cannot be dealt with by ComReg
ga: Ba cheart a thabhairt faoi deara nach féidir le ComReg déileáil le díospóidí a bhaineann le costas glao seirbhís ardráta

source: You will need to get in touch directly with the service provider to make your complaint
ga: Beidh ort teagmháil dhíreach a dhéanamh leis an soláthraí seirbhíse le do ghearán a dhéanamh

source: There is no charge for making a complaint to ComReg
ga: Ní ghearrtar aon táille chun gearán a dhéanamh le ComReg

source: You should first contact your service provider with your complaint
ga: Ba cheart duit teagmháil a dhéanamh le do sholáthraí seirbhíse le do ghearán ar dtús

source: If the complaint relates to an advertisement of a service in print, radio or television, you should mention the date, time, location and media in which the advertisement appeared
ga: Má bhaineann an gearán le fógraíocht seirbhíse atá clóite, ar an raidió nó ar an teilifís, ba cheart duit dáta, am, láthair agus na meáin a lua ina raibh an fógra le sonrú

source: If you are not satisfied you can submit our complaint to ComReg
ga: Mura bhfuil tú sásta, féadfaidh tú do ghearán a chur faoi bhráid ComReg

source: ComReg will investigate all complaints made within 9 months from when the call was made or when the promotional materials concerned was published
ga: Fiosróidh ComReg gach gearán a dhéantar laistigh de 9 mhí ón tráth a rinneadh an glao nó nuair a foilsíodh na hábhair um chur chun cinn lenar bhain

source: You can read more about premium rate services and complaining to ComReg
ga: Féadfaidh tú níos mó a léamh faoi sheirbhísí ardráta agus faoi ghearán a dhéanamh le ComReg anseo
